#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/adff0b92-be4a-4ee8-8373-840a279eeaa3/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {
      + host_project    = "central-gcp-vpc-non-prod-37070"
      + id              = (known after apply)
      + service_project = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-west1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-01"
    }

  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[1] will be created
  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + project    = "central-gcp-vpc-non-prod-37070"
      + region     = "us-central1"
      + role       = "roles/compute.networkUser"
      + subnetwork = "subnet-02"
    }

  # module.project-factory["new-luis"].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01710A-17EA16-57FCD3"
      + folder_id           = "250869018475"
      + id                  = (known after apply)
      + labels              = {
          + "cost-center"   = "123456"
          + "project-owner" = "luis"
          + "tech-owner"    = "pedro-mendez"
        }
      + name                = "new-luis"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_resource_manager_lien.lien[0] will be created
  + resource "google_resource_manager_lien" "lien" {
      + create_time  = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + origin       = "project-factory"
      + parent       = (known after apply)
      + reason       = "Project Factory lien"
      + restrictions = [
          + "resourcemanager.projects.delete",
        ]
    }

  # module.project-factory["new-luis"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["oslogin.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "oslogin.googleapis.com"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = (known after apply)%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created%0A  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {%0A      + host_project    = "central-gcp-vpc-non-prod-37070"%0A      + id              = (known after apply)%0A      + service_project = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[0] will be created%0A  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + member     = (known after apply)%0A      + project    = "central-gcp-vpc-non-prod-37070"%0A      + region     = "us-west1"%0A      + role       = "roles/compute.networkUser"%0A      + subnetwork = "subnet-01"%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_compute_subnetwork_iam_member.apis_service_account_role_to_vpc_subnets[1] will be created%0A  + resource "google_compute_subnetwork_iam_member" "apis_service_account_role_to_vpc_subnets" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + member     = (known after apply)%0A      + project    = "central-gcp-vpc-non-prod-37070"%0A      + region     = "us-central1"%0A      + role       = "roles/compute.networkUser"%0A      + subnetwork = "subnet-02"%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_project.main will be created%0A  + resource "google_project" "main" {%0A      + auto_create_network = false%0A      + billing_account     = "01710A-17EA16-57FCD3"%0A      + folder_id           = "250869018475"%0A      + id                  = (known after apply)%0A      + labels              = {%0A          + "cost-center"   = "123456"%0A          + "project-owner" = "luis"%0A          + "tech-owner"    = "pedro-mendez"%0A        }%0A      + name                = "new-luis"%0A      + number              = (known after apply)%0A      + project_id          = (known after apply)%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created%0A  + resource "google_project_default_service_accounts" "default_service_accounts" {%0A      + action           = "DEPRIVILEGE"%0A      + id               = (known after apply)%0A      + project          = (known after apply)%0A      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"%0A      + service_accounts = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_resource_manager_lien.lien[0] will be created%0A  + resource "google_resource_manager_lien" "lien" {%0A      + create_time  = (known after apply)%0A      + id           = (known after apply)%0A      + name         = (known after apply)%0A      + origin       = "project-factory"%0A      + parent       = (known after apply)%0A      + reason       = "Project Factory lien"%0A      + restrictions = [%0A          + "resourcemanager.projects.delete",%0A        ]%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.random_id.random_project_id_suffix will be created%0A  + resource "random_id" "random_project_id_suffix" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 2%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.random_string.random_project_id_suffix[0] will be created%0A  + resource "random_string" "random_project_id_suffix" {%0A      + id          = (known after apply)%0A      + length      = 4%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (known after apply)%0A      + special     = false%0A      + upper       = false%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = true%0A      + id                         = (known after apply)%0A      + project                    = (known after apply)%0A      + service                    = "compute.googleapis.com"%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["oslogin.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = true%0A      + id                         = (known after apply)%0A      + project                    = (known after apply)%0A      + service                    = "oslogin.googleapis.com"%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*